{
	"label": "Klippa OCR API",
	"description": "A Automation Anywhere Command to call the Klippa OCR API using a Automation Anywhere Bot. The Klippa OCR API provides real-time document extraction using OCR and Machine Learning, just send us the document and we provide you with the document content in a structured way to automate your document workflow.",
	"ParseDocument.label": "Parse document",
	"ParseDocument.node_label": "Parse document",
	"ParseDocument.description": "Parse a document using the Klippa OCR API. Parses a GIF, PNG, JPG, HEIC/HEIF or PDF file.",
	"ParseDocument.return_label": "A Dictionary with the JSON response as a string and the parsed version as a Dictionary. The first level contains the raw json response string in the key \"response\", the data with keys/values as described in our API documentation is in the key \"data\".",
	"ParseDocument.BasePath.label": "Klippa OCR API base path",
	"ParseDocument.BasePath.description": "The base path to the Klippa API.",
	"ParseDocument.APIKey.label": "API Key",
	"ParseDocument.APIKey.description": "The auth key provided by Klippa",
	"ParseDocument.DocumentURL.label": "Document URL",
	"ParseDocument.DocumentURL.description": "The document to scan as a file available at this URL.",
	"ParseDocument.DocumentPath.label": "Document Path",
	"ParseDocument.DocumentPath.description": "The document to scan as a file path.",
	"ParseDocument.Template.label": "Template",
	"ParseDocument.Template.description": "The template to use for parsing. Empty for default parsing.",
	"ParseDocument.PDFTextExtraction.label": "PDF Text extraction",
	"ParseDocument.PDFTextExtraction.description": "Use full when you want the best quality scan, use fast when you want fast scan results. Fast will try to extract the text from the PDF. Full will actually scan the full PDF, which is slower.",
	"ParseDocument.PDFTextExtraction.fast.label": "Fast",
	"ParseDocument.PDFTextExtraction.full.label": "Full",
	"ParseDocument.UserData.label": "User Data",
	"ParseDocument.UserData.description": "Extra metadata in JSON format to give to the parser. Only works with templates that are configured to accept user data.",
	"ParseDocument.UserDataSetExternalID.label": "User Data Set External ID",
	"ParseDocument.UserDataSetExternalID.description": "The external ID of the user data set.",
	"ParseDocument.HashDuplicateGroupID.label": "Hash Duplicate Group ID",
	"ParseDocument.HashDuplicateGroupID.description": "An identifier to use when saving/detecting hash duplicates. This way you can allow to have the same document scanned more than once for multiple groups. When doing a scan, the combination of the Hash Group ID and the document Hash will be used to detect duplicates. This value is saved hashed on our side. Common use cases: Company ID, Campaign ID, User ID."
}